{"id":"1500","sku":"425-C516","name":"Chiroform Knee & Shoulder Massager","descr":"\r\n<p>The worlds first portable knee and shoulder rehabilitation brace.</p>\r\n<p>Recommended For<br />\r\n\t&nbsp;<br />\r\n\tSomeone who: <br />\r\n\t•&nbsp; Feels sore or painful when stepping up/down stairs or moving the knee-joint <br />\r\n\t•&nbsp; Has swollen or stiff knees after movement or in the afternoon or evening <br />\r\n\t•&nbsp; Has stiff movement and feels uncomfortable around the joints </p>\r\n<p>•&nbsp; Feels painful around the knee-joints at changed or cloudy weather <br />\r\n\t•&nbsp; Is aged with degenerative naturopathy or needs to prevent such diseases </p>\r\n<p>Specification<br />\r\n\t•&nbsp;World´s first portable knee rehabilitation brace that employs thermal technology. <br />\r\n\t•&nbsp;The innovative knee-muscle-pain-reliever, Knee Massager gets thermal energy deep into the knees by thermal radiation, mitigating pain in the knee muscles quickly. <br />\r\n\t•&nbsp;Ergonomically designed,&nbsp;Knee Massager deploys thermal cathodes correctly to the knee structure so that the thermal energy penetrates deep into the knee. Over time this improves symptoms. <br />\r\n\t•&nbsp;The surface of the thermal cathodes is made of the purest silver which has the highest thermal conductivity, so thermal energy is delivered quickly to the knees along with the natural antibacterial and antibiotic effects. <br />\r\n\t•&nbsp;Exact temperature is maintained through the temperature control system and can be set between 45 and 65 degrees Celsius. Extended usage is possible. <br />\r\n\t•&nbsp;Vibration massage function can mitigate pain in the knee muscles quickly.</p>\r\n<p>We highly recommend the use of the Safe Pad underneath the Knee Massager&nbsp;as applying Knee Massager&nbsp;directly to the skin may cause skin burn. <br />\r\n\t</p>\r\n<p>Effective Usage<br />\r\n\t•&nbsp;Usage before physical activities, warms up the muscles around the knee, alleviates pain and prevents aggravating inflammation thereby aiding smooth performance of any physical activity. <br />\r\n\t•&nbsp;For maximum treatment efficiency it is recommended to use Knee Massager&nbsp; 2-3 times a day for 30 minutes per session. The optimal temperature is when the user feels a soothing warmth in the knee. <br />\r\n\t•&nbsp;Once the pain has been alleviated through the use of Knee Massager, we recommend continuing non-strenuous exercises. <br />\r\n\t•&nbsp;Knee Massager is an electrical device. As such it is not machine washable. Should the need to clean Knee Massager arise, please use a dry cloth and gently wipe</p>\r\n<p>\r\n\t<iframe src=\"https://www.youtube.com/embed/-MQQa99S_hQ\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"300\" height=\"225\" frameborder=\"0\"></iframe></p> "}