{"id":"1525","sku":"520-TT-525-E","name":"Techniques Table 525E","descr":"The Techniques Model 525 Breakaway Treatment Table is strong and sturdy with the added feature of a 7” thoracic breakaway section to provide comfort to patients with a large abdominal region. Through extensive research done while participating in Thompson Technique Seminars the newly designed smooth, quick, quiet and easier to engage drop sections were incorporated into this table. The TT-525 is available with two types of height adjustability. Choose the manual pump elevation to raise and lower the treatment table with no wires or cords to hassle over. Choose the electric elevation model and enjoy effortless height adjustability at a push of a button. All 500 series treatment tables offer a<br />\r\n7” (18cm) adjustable height range from standard 19”-26” (48-66cm) or optional 23”-30” (58-76cm).<br />\r\n<br />\r\nAll Techniques Tables are manufactured with the highest grade materials for durability and reliability. The new modern designed base along with welded steel construction make for a strong and sturdy frame. All cushions are made with a premium health care grade upholstery and high density foam allowing for minimal effort adjusting, while providing maximum patient comfort. With many different features and options available, this table is suitable for many uses, such as Chiropractic, Osteopathic, Naturopathic, Acupuncture, ART and can also be customized to accommodate any health care practitioners<br />\r\nneeds.<br />\r\n<br />\r\nStandard Features<br />\r\n&nbsp;<br />\r\n&nbsp;&nbsp;&nbsp; 21” wide adjusting surface<br />\r\n&nbsp;&nbsp;&nbsp; Standard height 19”-26” (48cm-66cm)<br />\r\n&nbsp;&nbsp;&nbsp; Electric Elevations with 2 foot pedals included<br />\r\n&nbsp;&nbsp;&nbsp; (TT-525-E only)<br />\r\n&nbsp;&nbsp;&nbsp; High density foam<br />\r\n&nbsp;&nbsp;&nbsp; Multidirectional head piece (elevation and tilt, two<br />\r\n&nbsp;&nbsp;&nbsp; split cushions with arm rests)<br />\r\n&nbsp;&nbsp;&nbsp; Adjustable thoracic breakaway section<br />\r\n&nbsp;&nbsp;&nbsp; (breakaway and elevate)<br />\r\n&nbsp;&nbsp;&nbsp; Elevating thoracic, lumbar and knee break sections<br />\r\n&nbsp;&nbsp;&nbsp; with leg extension<br />\r\n&nbsp;&nbsp;&nbsp; Levelling floor glides<br />\r\n&nbsp;&nbsp;&nbsp; Sturdy steel construction<br />\r\n&nbsp;&nbsp;&nbsp; Wide assortment of colours in health care grade<br />\r\n&nbsp;&nbsp;&nbsp; upholstery<br />\r\n&nbsp;&nbsp;&nbsp; Table is fully upgradeable at any time, upgrades<br />\r\n&nbsp;&nbsp;&nbsp; simply bolt on<br />\r\n&nbsp;&nbsp;&nbsp; Foot activated drops with pedals located on both<br />\r\n&nbsp;&nbsp;&nbsp; sides of the table (when drop section is added)<br />\r\n&nbsp;<br />\r\nOptions<br />\r\n<br />\r\n&nbsp;&nbsp;&nbsp; TT-300 Cervical drop section<br />\r\n&nbsp;&nbsp;&nbsp; TT-301 Thoracic drop section<br />\r\n&nbsp;&nbsp;&nbsp; TT-302 Lumbar drop section<br />\r\n&nbsp;&nbsp;&nbsp; TT-304 Upper Thoracic Drop Section<br />\r\n&nbsp;&nbsp;&nbsp; TT-400 Manual Pump Elevation 19-26\" (23-30\" optional)<br />\r\n&nbsp;&nbsp;&nbsp; TT-450 Side extensions (4 cushions, allow the therapist to widen the table surface wider when needed)<br />\r\n&nbsp;&nbsp;&nbsp; TT-410 Electric Elevations with 2 pedals included (23-30\" optional)<br />\r\n&nbsp;&nbsp;&nbsp; Table can also be custom made to specific needs (call for details)<br />\r\n&nbsp;<br />\r\n    "}