{"id":"1597","sku":"RGC200","name":"Rekongem Anti-Cellulite Massage Milk 200 ml","descr":"It is a highly effective well vascular gel-emulsion massage milk.<br />\r\n<br />\r\nThe main effective substance is a pepper fruits extract (capsaicin) which, during the massage makes the skin well blood perfuse and become heated. It increases metabolism and supports fat cell breakdown and superfl uous water revulsion from tissue. Thanks to the heated milk massage the complexion elasticity increases, small cellulite scars vanish quickly and the complexion is smoother. This massage ointment is easy to spread and absorb and has a higher effect on the deeper layers of skin. The heating function is increased by a suitable quantity of methylsalicylat which also improves joint movement, spasm release and muscle rigidity. It also eases off tiredness fast. REKONGEM special Capsica – Anti<br />\r\nCellulite is a suitable helper for fi gure shaping, weight decreasing and cellulite removing.<br />\r\n<br />\r\nUsage: Apply the appropriate quantity on desired spots (hips, thighs, hindquarters, and belly) and by the help of circling movements massage the skin intensively. Continue massaging up to full vascular and light skin reddening. If you want to increase the cure effect we recommend exercising the appropriate parts of the body or to cover the massaged places with a plastic fi lm and leave the ointment to react. The time of reaction is individual. Rekongem Capsica can be used 2 – 3 per day as necessary.<br />\r\n<br />\r\nRecommendation: After completing the application (massage or wrap) we recommend using products of the REKONGEM series: Rekongem Chamomilla - chamomile or Rekongem Agrim – hemp agrimony which are suitable because of the contents of their extracts, and they react the same way as a healing balm for skin relief.<br />\r\n<br />\r\nWarning: It is determined for external use only. Do not use in the course of pregnancy and breast feeding and not for small children. Avoid eye and mucosa contact. Light skin irritation and reddening and its \"burning” is a sign of intensive vascular is a desirable resulting effect. For persons with oversensitive complexion it is recommended to perform a toleration test by means of applying of very small quantity of massage milk on the area of the elbow socket.<br />\r\n<br />\r\nDermatologicaly tested. Effect on the skin: Neutral pH-value.<br />\r\n&nbsp;<br />\r\n<br />\r\n"}