{"id":"1644","sku":"C1","name":"The Pediatric \"First Adjustment\" Seminar","descr":"\r\n<div>SOLD OUT - SOLD OUT - SOLD OUT<br />\r\n\t</div>\r\n<div><br />\r\n\t</div>\r\n<div>By Dr. Claudia Anrig.<br />\r\n\t</div>\r\n<div>&nbsp;</div>\r\n<div>Limited to 50 seats only!&nbsp; </div>\r\n<div>&nbsp;</div>\r\n<div>\r\n\t<div>Only available for Chiropractors and Chiropractic students.</div></div>\r\n<div>&nbsp;</div>DATE: 31/8-1/9 2019<br />\r\n&nbsp;<br />\r\nLOCATION: Hotel Kong Arthur, Copenhagen (Denmark).<br />\r\n&nbsp;<br />\r\n\r\n<div>BRIEF DESCRIPTION:</div>\r\n<div>&nbsp;</div>\r\n<div>Who better to guide you in building your family practice to its fullest potential than Dr. Claudia Anrig, originator of the first Pediatric Seminars for Chiropractors? Only Dr. Claudia can give you the DEPTH you need in these critical disciplines: ACADEMIC, TECHNIQUE and CLINICAL!<br />\r\n\t<br />\r\n\tFor over 25 years Dr. Claudia Anrig has earned an unparalleled reputation for her academic, technical and clinical approach to developing family wellness practices.<br />\r\n\t<br />\r\n\tAnd now, with First Adjustment, you can benefit from the Family Practice model that Dr. Claudia built from her vast experience in personally adjusting hundreds of patients and their families every week.<br />\r\n\t<br />\r\n\tYou’ll get practical, hands-on tools and proven techniques from one of the best teachers worldwide that will have you ready to put into practice on Monday everything you’ve learned over one convenient weekend.<br />\r\n\t<br />\r\n\tWith First Adjustment, you’ll discover how to adapt your existing techniques to produce an immediate response from families, in your numbers and in your development as a doctor who is in healthy balance.<br />\r\n\t<br />\r\n\t</div>\r\n<div>Specific questions pertaining to this seminar may be directed to chiroform@chiroform.dk</div>\r\n<div><br />\r\n\t</div>\r\n<iframe src=\"https://www.youtube.com/embed/ChgWKBPE9oU\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"300\" height=\"225\" frameborder=\"0\"></iframe>     "}