{"id":"1709","sku":"332-C-8100","name":"Air Relax Compression Massage","descr":"Just like the high-end compression devices used by the top teams and athletes, now available to the public!<br />\r\n\r\n<div>&nbsp;</div>\r\n<div>Enjoy years of massage for the price of a few hours from a professional, or use it between sessions to complement your current massage work.</div><br />\r\nHow Premium Air Relax Compression work:<br />\r\n<br />\r\nPremium Air Relax technology isn´t like your old compression pants/socks. Compare it instead to a professional recovery massage. The leg cuffs go from your foot or ankle (depending on your height) all the way up your thigh, with 4 air chambers that fill in sequence, gradually compressing each muscle group in your legs and feet, and then repeating, to increase circulation, and flush the lactic acid from your legs after a tough workout. Choose from different cycles of 15 minutes each, with multiple power levels, and point massage options for problem areas.<br />\r\n<br />\r\nCompression power ranges from 50mmhg to 200mmhg, depending on your size and desired compression level.<br />\r\n<br />\r\nRecommended Use;<br />\r\n\r\n<div>&nbsp;</div>\r\n<div>It’s best to use your Premium Air Relax in the evenings, after a workout. Your power setting should depend on your next workout, so if you have a big workout the next day, you want to keep it light, and only use one or two 15-minute cycles. If you’re off the next day, you can use a harder setting for two to three cycles.</div><br />\r\nFeatures:<br />\r\n- Multi-Chamber pressure displays<br />\r\n- Four compression chambers<br />\r\n- No prescription needed<br />\r\n- Automatic pressure variation between chambers<br />\r\n\r\n<div>- Four different pressure levels</div>\r\n<div>&nbsp;&nbsp;</div>\r\n<div>   </div>\r\n<iframe width=\"300\" height=\"225\" src=\"https://www.youtube.com/embed/glNavQFIwSQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>"}