{"id":"1717","sku":"607-PX-1","name":"PainXit","descr":"\r\n<div><span style=\"font-weight: bold;\">Get familiar with PainXit</span></div>\r\n<div><br />\r\n\t</div>\r\n<div>PainXit pain relief pen is a portable fast-working, easy and effective, super simple and safe medical device designed to relieve both acute and chronic pain. It’s efficacy is based on the widely accepted medical technique known as TENS or TNS using low-frequency electrical pulses through the skin to activate your body´s own natural defense system against pain – the endorphins – to relieve both chronic and acute pain when and where you need it. Drug-free and 100% natural. NO side effects. You can´t overdose. Super simple and safe.</div>\r\n<div><br />\r\n\t</div>\r\n<div><span style=\"font-weight: bold;\">What kind of pain can PainXit relieve?</span></div>\r\n<div>PainXit can be used for various types of both acute and chronic pain e.g. arthritis, rheumatism and osteoporosis as well as lumbago, sciatica, phantom-limb pain and chronic neuropathy. Ideal for the elderly or sick, and people with weak hand strength due to the super simple \"2-click”-system.</div>\r\n<div>PainXit also takes care of muscle pain, back and shoulder pain, knee pain and other pain related to sport e.g. tennis elbow.</div>\r\n<div>PainXit is good to have around the house, in the car or in your purse to help out when the kids scrape the knee or the bee sting hurts too much and all other daily pain situations that occur in the family. Make sure to treat the skin around the wound and not use PainXit directly on the open wound, see \"When NOT to use PainXit” below.</div>\r\n<div><br />\r\n\t</div>\r\n<div><span style=\"font-weight: bold;\">How to use PainXit</span></div>\r\n<div>PainXit works with a super simple ’2-click’ system;</div>\r\n<div>1. Simply place the tip of PainXit on the skin on the area of the pain, ’click’ once on the red push down button on top of the pen, to start treatment.</div>\r\n<div>&nbsp;Keep the position with PainXit touching the area of the pain during the 1-5 minutes pain relief treatment while you relax and let PainXit do its job.</div>\r\n<div>2. Push the red button on top of the pen once again, –’click’– to stop the pain relief treatment. Repeat when needed. No risk of overdosing. No gel, no pads, no drugs. Replace the AAA battery when needed. Super simple and safe, easy and effective.</div>\r\n<div><br />\r\n\t</div>\r\n<div><span style=\"font-weight: bold;\">Technical Information</span></div>\r\n<div>Description: Portable electronic stimulator</div>\r\n<div>&nbsp;Classification: Class IIa medical devices</div>\r\n<div>&nbsp;Product dimensions: 130 x Ø26 mm</div>\r\n<div>&nbsp;Energy: 0.4 mJ at 1000 W</div>\r\n<div>&nbsp;Operating temperature: 0ºC – 40º C. R.H.&lt; 90%</div>\r\n<div>&nbsp;Storage temperature: -20ºC – +50º C</div>\r\n<div>&nbsp;Average product life: 2 years</div>\r\n<div><br />\r\n\t</div><br />\r\n       "}