{"id":"2584","sku":"404-WW9781451185430","name":"Pediatric Chiropractic 2nd Edition Book","descr":"\r\n<div>Pediatric Chiropractic, Second edition is a comprehensive resource that covers a wide range of information on pediatric chiropractic care. An international panel of 42 experts contributed to this book. Among the many topics covered are: care during pregnancy and the perinatal period, subluxation, clinical and radiological examination, child abuse, adolescent health, spinal trauma, scoliosis, pediatric nutrition, vaccination issues, and full spine and cranial adjustments.&nbsp; This reference carefully illustrates that the chiropractor is an appropriate and necessary provider of health care for children.</div>\r\n<div><br />\r\n\t</div>\r\n<div>\"This comprehensive overview of the growing field of chiropractic management of pediatric patients covers history and wellness, fundamentals, pregnancy, neurology, orthopedics, primary care, adolescent health, and specialized practices and techniques. An update of a book long used in chiropractic education, it adds a significant amount of new material.\"</div>\r\n<div><br />\r\n\t</div>\r\n<div>\"This edition is a significant change from the original, which was widely used in the chiropractic profession. Given the extensive growth related to pediatric chiropractic, it is long past due. It compares quite favorably to its sole competitor, \"Chiropractic Pediatrics: A Clinical Handbook, 2nd edition, Davies and Fallon (Elsevier, 2010) (disclosure: I wrote the foreword for Dr. Davies´ book).\"&nbsp; It will be eagerly anticipated by those who teach this discipline and should be embraced across the profession. It takes a more conservative approach than does the Davies book, but it fairly presents the material and the new sections are well considered and comprehensive.\"</div>\r\n<div><br />\r\n\t</div>\r\n<div>- Doody´s Book Review (November 2012)</div>\r\n<div>Dana J Lawrence, DC, MMedEd, MA(Palmer College of Chiropractic)</div>\r\n<div>Weighted Numerical Score: 97 - 5 Stars!</div>\r\n<div><br />\r\n\t</div>   "}