{"id":"2649","sku":"609-1000","name":"Live Right for Your Species Type Book","descr":"\r\n<div>\r\n\t<div>Chronic illness rates have exponentially risen over the last century, chronic illness now kills 80% of humans living in Industrial Society. During this period of exponential increase in chronic illness humangenes have not changed. It is neither scientific nor logical to blame the human chronic illness pandemic on \"bad genes”. In fact, no species on earth has ever become endangered or gone extinct because of bad genes. Genes are naturally selected over time to create more health not more sickness – this is biological law.&nbsp;</div>\r\n\t<div><br />\r\n\t\t</div>\r\n\t<div>Research is unequivocal, chronic illness is unhealthy lifestyle and unhealthy environment illness. This has profound implications. It means that drugs will never be the solution because drugs can neither prevent nor cure problems caused by poor nutrition, sedentary living, psychosocial stress, or pollutants. There is only one evidence-based, scientific, and logical wellness and prevention solution and that is adopting and maintaining healthy lifestyle habits and healthy physical and social habitats. If you want to maximize your potential and your chances to get and stay well and avoid chronic illness you must develop and maintain healthy eating, moving, thinking, and social interaction habits and we all must help maintain healthy physical and social human habitats. In other words, you must ‘Live Right for Your Species Type’.</div>\r\n\t<div><br />\r\n\t\t</div>\r\n\t<div>\"Dr. Chestnut presents an irrefutable argument for ‘Living Right for Your Species Type’. He has made the science understandable,</div>\r\n\t<div>the research accessible, and the logic self-evident. Most importantly, he provides a brilliantly simple model</div>\r\n\t<div>of implementation in his Eat Well – Move Well – Think Well&reg; Lifestyle plan.”</div></div>\r\n<div>&nbsp;</div>\r\n<div>\r\n\t<iframe width=\"300\" height=\"225\" src=\"https://www.youtube.com/embed/9oRJAJbaYMk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></div>"}