{"id":"826","sku":"12850","name":"ESWT Shock Wave Unit","descr":"<P>12850 - E*SWT 2- EVOLUTED SHOCK WAVE THERAPY </P>\r\n<P>E*SWT  represents today an innovative system that can give rise to a new and effective therapeutic approach for the treatment of various pathologies regarding soft tissues and the skeletal system.</P>\r\n<P>E*SWT  is a system allowing you to perform an innovative methodology called extra-corporeal shock-waves therapy.</P>\r\n<P>E*SWT 2 is a versatile instrument, made for treating both soft (tendons and muscles) and hard tissues (bone).</P>\r\n<P>The thrust implemented by the end side of a suitable applicator, that the operator has to put in contact with the suffering region, gives rise to small impulses with high intensity that are transmitted into the tissue. This originates a resonance phenomenon causing antalgic processes, reduction of local phlogosis, new formation of blood vessels, reactivation of reparative processes.</P>\r\n<P>Although the unit E*SWT 2 and its application technique are a sort of derivation and adaptation of the shock wave therapy already used in other disciplines it represents for the physical therapy a novelty because of the lower energies employed and the therapeutic modalities that can take place in an ambulatory allowing to avoid any anaesthesia or sedation and furthermore any radiographic and/or ultrasound visualisation and/or monitoring system.</P>\r\n<P>All these features make the E*SWT 2 system a specific instrument for the treatment of pathologies into the physical therapy and orthopaedics field. The antalgic, osteo-inductive and vascular effects allow the treatment of a wide range of tendinous pathologies, but also allow the activation of processes involving the re-absorption of calcifications, especially when they are localised in the smallest joints, and help to increase the reparative processes (osteogenesis) in osteo-articular pathologies and fractures.</P>\r\n<P>A large colour display, where all the information is shown, make E*SWT  2 an extremely easy to use apparatus. The technology that uses microprocessor control, in fact, gives the operator the opportunity of modulating widely the different available parameters.</P>\r\n<P>For more information and prices, please visit the chiroform shop.<BR></P>"}